Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Infineon/XMC1400_series/Include/XMC1404.h
/* -----------------------------  SCU_INTERRUPT_SRCLR  ---------------------------- */
#define SCU_INTERRUPT_SRCLR_PRWARN_Pos        (0UL)                     /*!< SCU_INTERRUPT SRCLR: PRWARN (Bit 0)                         */
#define SCU_INTERRUPT_SRCLR_PRWARN_Msk        (0x1UL)                   /*!< SCU_INTERRUPT SRCLR: PRWARN (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR_PI_Pos            (1UL)                     /*!< SCU_INTERRUPT SRCLR: PI (Bit 1)                             */
#define SCU_INTERRUPT_SRCLR_PI_Msk            (0x2UL)                   /*!< SCU_INTERRUPT SRCLR: PI (Bitfield-Mask: 0x01)               */
#define SCU_INTERRUPT_SRCLR_AI_Pos            (2UL)                     /*!< SCU_INTERRUPT SRCLR: AI (Bit 2)                             */
#define SCU_INTERRUPT_SRCLR_AI_Msk            (0x4UL)                   /*!< SCU_INTERRUPT SRCLR: AI (Bitfield-Mask: 0x01)               */
#define SCU_INTERRUPT_SRCLR_VDDPI_Pos         (3UL)                     /*!< SCU_INTERRUPT SRCLR: VDDPI (Bit 3)                          */
#define SCU_INTERRUPT_SRCLR_VDDPI_Msk         (0x8UL)                   /*!< SCU_INTERRUPT SRCLR: VDDPI (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRCLR_ACMP0I_Pos        (4UL)                     /*!< SCU_INTERRUPT SRCLR: ACMP0I (Bit 4)                         */
#define SCU_INTERRUPT_SRCLR_ACMP0I_Msk        (0x10UL)                  /*!< SCU_INTERRUPT SRCLR: ACMP0I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR_ACMP1I_Pos        (5UL)                     /*!< SCU_INTERRUPT SRCLR: ACMP1I (Bit 5)                         */
#define SCU_INTERRUPT_SRCLR_ACMP1I_Msk        (0x20UL)                  /*!< SCU_INTERRUPT SRCLR: ACMP1I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR_ACMP2I_Pos        (6UL)                     /*!< SCU_INTERRUPT SRCLR: ACMP2I (Bit 6)                         */
#define SCU_INTERRUPT_SRCLR_ACMP2I_Msk        (0x40UL)                  /*!< SCU_INTERRUPT SRCLR: ACMP2I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR_VDROPI_Pos        (7UL)                     /*!< SCU_INTERRUPT SRCLR: VDROPI (Bit 7)                         */
#define SCU_INTERRUPT_SRCLR_VDROPI_Msk        (0x80UL)                  /*!< SCU_INTERRUPT SRCLR: VDROPI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR_ORC0I_Pos         (8UL)                     /*!< SCU_INTERRUPT SRCLR: ORC0I (Bit 8)                          */
#define SCU_INTERRUPT_SRCLR_ORC0I_Msk         (0x100UL)                 /*!< SCU_INTERRUPT SRCLR: ORC0I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRCLR_ORC1I_Pos         (9UL)                     /*!< SCU_INTERRUPT SRCLR: ORC1I (Bit 9)                          */
#define SCU_INTERRUPT_SRCLR_ORC1I_Msk         (0x200UL)                 /*!< SCU_INTERRUPT SRCLR: ORC1I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRCLR_ORC2I_Pos         (10UL)                    /*!< SCU_INTERRUPT SRCLR: ORC2I (Bit 10)                         */
#define SCU_INTERRUPT_SRCLR_ORC2I_Msk         (0x400UL)                 /*!< SCU_INTERRUPT SRCLR: ORC2I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRCLR_ORC3I_Pos         (11UL)                    /*!< SCU_INTERRUPT SRCLR: ORC3I (Bit 11)                         */
#define SCU_INTERRUPT_SRCLR_ORC3I_Msk         (0x800UL)                 /*!< SCU_INTERRUPT SRCLR: ORC3I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRCLR_ORC4I_Pos         (12UL)                    /*!< SCU_INTERRUPT SRCLR: ORC4I (Bit 12)                         */
#define SCU_INTERRUPT_SRCLR_ORC4I_Msk         (0x1000UL)                /*!< SCU_INTERRUPT SRCLR: ORC4I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRCLR_ORC5I_Pos         (13UL)                    /*!< SCU_INTERRUPT SRCLR: ORC5I (Bit 13)                         */
#define SCU_INTERRUPT_SRCLR_ORC5I_Msk         (0x2000UL)                /*!< SCU_INTERRUPT SRCLR: ORC5I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRCLR_ORC6I_Pos         (14UL)                    /*!< SCU_INTERRUPT SRCLR: ORC6I (Bit 14)                         */
#define SCU_INTERRUPT_SRCLR_ORC6I_Msk         (0x4000UL)                /*!< SCU_INTERRUPT SRCLR: ORC6I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRCLR_ORC7I_Pos         (15UL)                    /*!< SCU_INTERRUPT SRCLR: ORC7I (Bit 15)                         */
#define SCU_INTERRUPT_SRCLR_ORC7I_Msk         (0x8000UL)                /*!< SCU_INTERRUPT SRCLR: ORC7I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRCLR_LOCI_Pos          (16UL)                    /*!< SCU_INTERRUPT SRCLR: LOCI (Bit 16)                          */
#define SCU_INTERRUPT_SRCLR_LOCI_Msk          (0x10000UL)               /*!< SCU_INTERRUPT SRCLR: LOCI (Bitfield-Mask: 0x01)             */
#define SCU_INTERRUPT_SRCLR_PESRAMI_Pos       (17UL)                    /*!< SCU_INTERRUPT SRCLR: PESRAMI (Bit 17)                       */
#define SCU_INTERRUPT_SRCLR_PESRAMI_Msk       (0x20000UL)               /*!< SCU_INTERRUPT SRCLR: PESRAMI (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRCLR_PEU0I_Pos         (18UL)                    /*!< SCU_INTERRUPT SRCLR: PEU0I (Bit 18)                         */
#define SCU_INTERRUPT_SRCLR_PEU0I_Msk         (0x40000UL)               /*!< SCU_INTERRUPT SRCLR: PEU0I (Bitfield-Mask: 0x01)            */
#define SCU_INTERRUPT_SRCLR_FLECC2I_Pos       (19UL)                    /*!< SCU_INTERRUPT SRCLR: FLECC2I (Bit 19)                       */
#define SCU_INTERRUPT_SRCLR_FLECC2I_Msk       (0x80000UL)               /*!< SCU_INTERRUPT SRCLR: FLECC2I (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRCLR_FLCMPLTI_Pos      (20UL)                    /*!< SCU_INTERRUPT SRCLR: FLCMPLTI (Bit 20)                      */
#define SCU_INTERRUPT_SRCLR_FLCMPLTI_Msk      (0x100000UL)              /*!< SCU_INTERRUPT SRCLR: FLCMPLTI (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRCLR_VCLIPI_Pos        (21UL)                    /*!< SCU_INTERRUPT SRCLR: VCLIPI (Bit 21)                        */
#define SCU_INTERRUPT_SRCLR_VCLIPI_Msk        (0x200000UL)              /*!< SCU_INTERRUPT SRCLR: VCLIPI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR_SBYCLKFI_Pos      (22UL)                    /*!< SCU_INTERRUPT SRCLR: SBYCLKFI (Bit 22)                      */
#define SCU_INTERRUPT_SRCLR_SBYCLKFI_Msk      (0x400000UL)              /*!< SCU_INTERRUPT SRCLR: SBYCLKFI (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRCLR_RTC_CTR_Pos       (24UL)                    /*!< SCU_INTERRUPT SRCLR: RTC_CTR (Bit 24)                       */
#define SCU_INTERRUPT_SRCLR_RTC_CTR_Msk       (0x1000000UL)             /*!< SCU_INTERRUPT SRCLR: RTC_CTR (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRCLR_RTC_ATIM0_Pos     (25UL)                    /*!< SCU_INTERRUPT SRCLR: RTC_ATIM0 (Bit 25)                     */
#define SCU_INTERRUPT_SRCLR_RTC_ATIM0_Msk     (0x2000000UL)             /*!< SCU_INTERRUPT SRCLR: RTC_ATIM0 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRCLR_RTC_ATIM1_Pos     (26UL)                    /*!< SCU_INTERRUPT SRCLR: RTC_ATIM1 (Bit 26)                     */
#define SCU_INTERRUPT_SRCLR_RTC_ATIM1_Msk     (0x4000000UL)             /*!< SCU_INTERRUPT SRCLR: RTC_ATIM1 (Bitfield-Mask: 0x01)        */
#define SCU_INTERRUPT_SRCLR_RTC_TIM0_Pos      (27UL)                    /*!< SCU_INTERRUPT SRCLR: RTC_TIM0 (Bit 27)                      */
#define SCU_INTERRUPT_SRCLR_RTC_TIM0_Msk      (0x8000000UL)             /*!< SCU_INTERRUPT SRCLR: RTC_TIM0 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRCLR_RTC_TIM1_Pos      (28UL)                    /*!< SCU_INTERRUPT SRCLR: RTC_TIM1 (Bit 28)                      */
#define SCU_INTERRUPT_SRCLR_RTC_TIM1_Msk      (0x10000000UL)            /*!< SCU_INTERRUPT SRCLR: RTC_TIM1 (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRCLR_TSE_DONE_Pos      (29UL)                    /*!< SCU_INTERRUPT SRCLR: TSE_DONE (Bit 29)                      */
#define SCU_INTERRUPT_SRCLR_TSE_DONE_Msk      (0x20000000UL)            /*!< SCU_INTERRUPT SRCLR: TSE_DONE (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRCLR_TSE_HIGH_Pos      (30UL)                    /*!< SCU_INTERRUPT SRCLR: TSE_HIGH (Bit 30)                      */
#define SCU_INTERRUPT_SRCLR_TSE_HIGH_Msk      (0x40000000UL)            /*!< SCU_INTERRUPT SRCLR: TSE_HIGH (Bitfield-Mask: 0x01)         */
#define SCU_INTERRUPT_SRCLR_TSE_LOW_Pos       (31UL)                    /*!< SCU_INTERRUPT SRCLR: TSE_LOW (Bit 31)                       */
#define SCU_INTERRUPT_SRCLR_TSE_LOW_Msk       (0x80000000UL)            /*!< SCU_INTERRUPT SRCLR: TSE_LOW (Bitfield-Mask: 0x01)          */

