Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Infineon/XMC1400_series/Include/XMC1404.h
/* -------------------------------  SCU_CLK_OSCCSR  ------------------------------- */
#define SCU_CLK_OSCCSR_OSC2L_Pos              (0UL)                     /*!< SCU_CLK OSCCSR: OSC2L (Bit 0)                               */
#define SCU_CLK_OSCCSR_OSC2L_Msk              (0x1UL)                   /*!< SCU_CLK OSCCSR: OSC2L (Bitfield-Mask: 0x01)                 */
#define SCU_CLK_OSCCSR_OSC2H_Pos              (1UL)                     /*!< SCU_CLK OSCCSR: OSC2H (Bit 1)                               */
#define SCU_CLK_OSCCSR_OSC2H_Msk              (0x2UL)                   /*!< SCU_CLK OSCCSR: OSC2H (Bitfield-Mask: 0x01)                 */
#define SCU_CLK_OSCCSR_DCO1PD_Pos             (8UL)                     /*!< SCU_CLK OSCCSR: DCO1PD (Bit 8)                              */
#define SCU_CLK_OSCCSR_DCO1PD_Msk             (0x100UL)                 /*!< SCU_CLK OSCCSR: DCO1PD (Bitfield-Mask: 0x01)                */
#define SCU_CLK_OSCCSR_OWDRES_Pos             (16UL)                    /*!< SCU_CLK OSCCSR: OWDRES (Bit 16)                             */
#define SCU_CLK_OSCCSR_OWDRES_Msk             (0x10000UL)               /*!< SCU_CLK OSCCSR: OWDRES (Bitfield-Mask: 0x01)                */
#define SCU_CLK_OSCCSR_OWDEN_Pos              (17UL)                    /*!< SCU_CLK OSCCSR: OWDEN (Bit 17)                              */
#define SCU_CLK_OSCCSR_OWDEN_Msk              (0x20000UL)               /*!< SCU_CLK OSCCSR: OWDEN (Bitfield-Mask: 0x01)                 */
#define SCU_CLK_OSCCSR_XOWDRES_Pos            (24UL)                    /*!< SCU_CLK OSCCSR: XOWDRES (Bit 24)                            */
#define SCU_CLK_OSCCSR_XOWDRES_Msk            (0x1000000UL)             /*!< SCU_CLK OSCCSR: XOWDRES (Bitfield-Mask: 0x01)               */
#define SCU_CLK_OSCCSR_XOWDEN_Pos             (25UL)                    /*!< SCU_CLK OSCCSR: XOWDEN (Bit 25)                             */
#define SCU_CLK_OSCCSR_XOWDEN_Msk             (0x2000000UL)             /*!< SCU_CLK OSCCSR: XOWDEN (Bitfield-Mask: 0x01)                */

/* -------------------------------  SCU_CLK_CLKCR1  ------------------------------- */
#define SCU_CLK_CLKCR1_FDIV_Pos               (0UL)                     /*!< SCU_CLK CLKCR1: FDIV (Bit 0)                                */
#define SCU_CLK_CLKCR1_FDIV_Msk               (0x3UL)                   /*!< SCU_CLK CLKCR1: FDIV (Bitfield-Mask: 0x03)                  */
#define SCU_CLK_CLKCR1_ADCCLKSEL_Pos          (8UL)                     /*!< SCU_CLK CLKCR1: ADCCLKSEL (Bit 8)                           */
#define SCU_CLK_CLKCR1_ADCCLKSEL_Msk          (0x100UL)                 /*!< SCU_CLK CLKCR1: ADCCLKSEL (Bitfield-Mask: 0x01)             */
#define SCU_CLK_CLKCR1_DCLKSEL_Pos            (9UL)                     /*!< SCU_CLK CLKCR1: DCLKSEL (Bit 9)                             */
#define SCU_CLK_CLKCR1_DCLKSEL_Msk            (0x200UL)                 /*!< SCU_CLK CLKCR1: DCLKSEL (Bitfield-Mask: 0x01)               */


/* ================================================================================ */
/* ================       struct 'SCU_RESET' Position & Mask       ================ */
/* ================================================================================ */


/* ------------------------------  SCU_RESET_RSTSTAT  ----------------------------- */
#define SCU_RESET_RSTSTAT_RSTSTAT_Pos         (0UL)                     /*!< SCU_RESET RSTSTAT: RSTSTAT (Bit 0)                          */
#define SCU_RESET_RSTSTAT_RSTSTAT_Msk         (0x3ffUL)                 /*!< SCU_RESET RSTSTAT: RSTSTAT (Bitfield-Mask: 0x3ff)           */
#define SCU_RESET_RSTSTAT_LCKEN_Pos           (10UL)                    /*!< SCU_RESET RSTSTAT: LCKEN (Bit 10)                           */
#define SCU_RESET_RSTSTAT_LCKEN_Msk           (0x400UL)                 /*!< SCU_RESET RSTSTAT: LCKEN (Bitfield-Mask: 0x01)              */

/* ------------------------------  SCU_RESET_RSTSET  ------------------------------ */
#define SCU_RESET_RSTSET_LCKEN_Pos            (10UL)                    /*!< SCU_RESET RSTSET: LCKEN (Bit 10)                            */
#define SCU_RESET_RSTSET_LCKEN_Msk            (0x400UL)                 /*!< SCU_RESET RSTSET: LCKEN (Bitfield-Mask: 0x01)               */

/* ------------------------------  SCU_RESET_RSTCLR  ------------------------------ */
#define SCU_RESET_RSTCLR_RSCLR_Pos            (0UL)                     /*!< SCU_RESET RSTCLR: RSCLR (Bit 0)                             */
#define SCU_RESET_RSTCLR_RSCLR_Msk            (0x1UL)                   /*!< SCU_RESET RSTCLR: RSCLR (Bitfield-Mask: 0x01)               */
#define SCU_RESET_RSTCLR_LCKEN_Pos            (10UL)                    /*!< SCU_RESET RSTCLR: LCKEN (Bit 10)                            */
#define SCU_RESET_RSTCLR_LCKEN_Msk            (0x400UL)                 /*!< SCU_RESET RSTCLR: LCKEN (Bitfield-Mask: 0x01)               */

/* ------------------------------  SCU_RESET_RSTCON  ------------------------------ */
#define SCU_RESET_RSTCON_ECCRSTEN_Pos         (0UL)                     /*!< SCU_RESET RSTCON: ECCRSTEN (Bit 0)                          */
#define SCU_RESET_RSTCON_ECCRSTEN_Msk         (0x1UL)                   /*!< SCU_RESET RSTCON: ECCRSTEN (Bitfield-Mask: 0x01)            */
#define SCU_RESET_RSTCON_LOCRSTEN_Pos         (1UL)                     /*!< SCU_RESET RSTCON: LOCRSTEN (Bit 1)                          */
#define SCU_RESET_RSTCON_LOCRSTEN_Msk         (0x2UL)                   /*!< SCU_RESET RSTCON: LOCRSTEN (Bitfield-Mask: 0x01)            */
#define SCU_RESET_RSTCON_SPERSTEN_Pos         (2UL)                     /*!< SCU_RESET RSTCON: SPERSTEN (Bit 2)                          */
#define SCU_RESET_RSTCON_SPERSTEN_Msk         (0x4UL)                   /*!< SCU_RESET RSTCON: SPERSTEN (Bitfield-Mask: 0x01)            */
#define SCU_RESET_RSTCON_U0PERSTEN_Pos        (3UL)                     /*!< SCU_RESET RSTCON: U0PERSTEN (Bit 3)                         */
#define SCU_RESET_RSTCON_U0PERSTEN_Msk        (0x8UL)                   /*!< SCU_RESET RSTCON: U0PERSTEN (Bitfield-Mask: 0x01)           */
#define SCU_RESET_RSTCON_U1PERSTEN_Pos        (4UL)                     /*!< SCU_RESET RSTCON: U1PERSTEN (Bit 4)                         */
#define SCU_RESET_RSTCON_U1PERSTEN_Msk        (0x10UL)                  /*!< SCU_RESET RSTCON: U1PERSTEN (Bitfield-Mask: 0x01)           */
#define SCU_RESET_RSTCON_MPERSTEN_Pos         (5UL)                     /*!< SCU_RESET RSTCON: MPERSTEN (Bit 5)                          */
#define SCU_RESET_RSTCON_MPERSTEN_Msk         (0x20UL)                  /*!< SCU_RESET RSTCON: MPERSTEN (Bitfield-Mask: 0x01)            */
#define SCU_RESET_RSTCON_LOECRSTEN_Pos        (6UL)                     /*!< SCU_RESET RSTCON: LOECRSTEN (Bit 6)                         */
#define SCU_RESET_RSTCON_LOECRSTEN_Msk        (0x40UL)                  /*!< SCU_RESET RSTCON: LOECRSTEN (Bitfield-Mask: 0x01)           */
#define SCU_RESET_RSTCON_MRSTEN_Pos           (16UL)                    /*!< SCU_RESET RSTCON: MRSTEN (Bit 16)                           */
#define SCU_RESET_RSTCON_MRSTEN_Msk           (0x10000UL)               /*!< SCU_RESET RSTCON: MRSTEN (Bitfield-Mask: 0x01)              */


/* ================================================================================ */
/* ================       struct 'COMPARATOR' Position & Mask      ================ */
/* ================================================================================ */


/* -----------------------------  COMPARATOR_ORCCTRL  ----------------------------- */
#define COMPARATOR_ORCCTRL_ENORC0_Pos         (0UL)                     /*!< COMPARATOR ORCCTRL: ENORC0 (Bit 0)                          */
#define COMPARATOR_ORCCTRL_ENORC0_Msk         (0x1UL)                   /*!< COMPARATOR ORCCTRL: ENORC0 (Bitfield-Mask: 0x01)            */
#define COMPARATOR_ORCCTRL_ENORC1_Pos         (1UL)                     /*!< COMPARATOR ORCCTRL: ENORC1 (Bit 1)                          */
#define COMPARATOR_ORCCTRL_ENORC1_Msk         (0x2UL)                   /*!< COMPARATOR ORCCTRL: ENORC1 (Bitfield-Mask: 0x01)            */
#define COMPARATOR_ORCCTRL_ENORC2_Pos         (2UL)                     /*!< COMPARATOR ORCCTRL: ENORC2 (Bit 2)                          */
#define COMPARATOR_ORCCTRL_ENORC2_Msk         (0x4UL)                   /*!< COMPARATOR ORCCTRL: ENORC2 (Bitfield-Mask: 0x01)            */
#define COMPARATOR_ORCCTRL_ENORC3_Pos         (3UL)                     /*!< COMPARATOR ORCCTRL: ENORC3 (Bit 3)                          */
#define COMPARATOR_ORCCTRL_ENORC3_Msk         (0x8UL)                   /*!< COMPARATOR ORCCTRL: ENORC3 (Bitfield-Mask: 0x01)            */
#define COMPARATOR_ORCCTRL_ENORC4_Pos         (4UL)                     /*!< COMPARATOR ORCCTRL: ENORC4 (Bit 4)                          */
#define COMPARATOR_ORCCTRL_ENORC4_Msk         (0x10UL)                  /*!< COMPARATOR ORCCTRL: ENORC4 (Bitfield-Mask: 0x01)            */
#define COMPARATOR_ORCCTRL_ENORC5_Pos         (5UL)                     /*!< COMPARATOR ORCCTRL: ENORC5 (Bit 5)                          */
#define COMPARATOR_ORCCTRL_ENORC5_Msk         (0x20UL)                  /*!< COMPARATOR ORCCTRL: ENORC5 (Bitfield-Mask: 0x01)            */
#define COMPARATOR_ORCCTRL_ENORC6_Pos         (6UL)                     /*!< COMPARATOR ORCCTRL: ENORC6 (Bit 6)                          */
#define COMPARATOR_ORCCTRL_ENORC6_Msk         (0x40UL)                  /*!< COMPARATOR ORCCTRL: ENORC6 (Bitfield-Mask: 0x01)            */
#define COMPARATOR_ORCCTRL_ENORC7_Pos         (7UL)                     /*!< COMPARATOR ORCCTRL: ENORC7 (Bit 7)                          */
#define COMPARATOR_ORCCTRL_ENORC7_Msk         (0x80UL)                  /*!< COMPARATOR ORCCTRL: ENORC7 (Bitfield-Mask: 0x01)            */
#define COMPARATOR_ORCCTRL_CNF0_Pos           (16UL)                    /*!< COMPARATOR ORCCTRL: CNF0 (Bit 16)                           */
#define COMPARATOR_ORCCTRL_CNF0_Msk           (0x10000UL)               /*!< COMPARATOR ORCCTRL: CNF0 (Bitfield-Mask: 0x01)              */
#define COMPARATOR_ORCCTRL_CNF1_Pos           (17UL)                    /*!< COMPARATOR ORCCTRL: CNF1 (Bit 17)                           */
#define COMPARATOR_ORCCTRL_CNF1_Msk           (0x20000UL)               /*!< COMPARATOR ORCCTRL: CNF1 (Bitfield-Mask: 0x01)              */
#define COMPARATOR_ORCCTRL_CNF2_Pos           (18UL)                    /*!< COMPARATOR ORCCTRL: CNF2 (Bit 18)                           */
#define COMPARATOR_ORCCTRL_CNF2_Msk           (0x40000UL)               /*!< COMPARATOR ORCCTRL: CNF2 (Bitfield-Mask: 0x01)              */
#define COMPARATOR_ORCCTRL_CNF3_Pos           (19UL)                    /*!< COMPARATOR ORCCTRL: CNF3 (Bit 19)                           */
#define COMPARATOR_ORCCTRL_CNF3_Msk           (0x80000UL)               /*!< COMPARATOR ORCCTRL: CNF3 (Bitfield-Mask: 0x01)              */
#define COMPARATOR_ORCCTRL_CNF4_Pos           (20UL)                    /*!< COMPARATOR ORCCTRL: CNF4 (Bit 20)                           */
#define COMPARATOR_ORCCTRL_CNF4_Msk           (0x100000UL)              /*!< COMPARATOR ORCCTRL: CNF4 (Bitfield-Mask: 0x01)              */
#define COMPARATOR_ORCCTRL_CNF5_Pos           (21UL)                    /*!< COMPARATOR ORCCTRL: CNF5 (Bit 21)                           */
#define COMPARATOR_ORCCTRL_CNF5_Msk           (0x200000UL)              /*!< COMPARATOR ORCCTRL: CNF5 (Bitfield-Mask: 0x01)              */
#define COMPARATOR_ORCCTRL_CNF6_Pos           (22UL)                    /*!< COMPARATOR ORCCTRL: CNF6 (Bit 22)                           */
#define COMPARATOR_ORCCTRL_CNF6_Msk           (0x400000UL)              /*!< COMPARATOR ORCCTRL: CNF6 (Bitfield-Mask: 0x01)              */
#define COMPARATOR_ORCCTRL_CNF7_Pos           (23UL)                    /*!< COMPARATOR ORCCTRL: CNF7 (Bit 23)                           */
#define COMPARATOR_ORCCTRL_CNF7_Msk           (0x800000UL)              /*!< COMPARATOR ORCCTRL: CNF7 (Bitfield-Mask: 0x01)              */

