Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Infineon/XMC1400_series/Include/XMC1404.h
/* ---------------------------------  PORT4_IOCR4  -------------------------------- */
#define PORT4_IOCR4_PC4_Pos                   (2UL)                     /*!< PORT4 IOCR4: PC4 (Bit 2)                                    */
#define PORT4_IOCR4_PC4_Msk                   (0xfcUL)                  /*!< PORT4 IOCR4: PC4 (Bitfield-Mask: 0x3f)                      */
#define PORT4_IOCR4_PC5_Pos                   (10UL)                    /*!< PORT4 IOCR4: PC5 (Bit 10)                                   */
#define PORT4_IOCR4_PC5_Msk                   (0xfc00UL)                /*!< PORT4 IOCR4: PC5 (Bitfield-Mask: 0x3f)                      */
#define PORT4_IOCR4_PC6_Pos                   (18UL)                    /*!< PORT4 IOCR4: PC6 (Bit 18)                                   */
#define PORT4_IOCR4_PC6_Msk                   (0xfc0000UL)              /*!< PORT4 IOCR4: PC6 (Bitfield-Mask: 0x3f)                      */
#define PORT4_IOCR4_PC7_Pos                   (26UL)                    /*!< PORT4 IOCR4: PC7 (Bit 26)                                   */
#define PORT4_IOCR4_PC7_Msk                   (0xfc000000UL)            /*!< PORT4 IOCR4: PC7 (Bitfield-Mask: 0x3f)                      */

/* ---------------------------------  PORT4_IOCR8  -------------------------------- */
#define PORT4_IOCR8_PC8_Pos                   (2UL)                     /*!< PORT4 IOCR8: PC8 (Bit 2)                                    */
#define PORT4_IOCR8_PC8_Msk                   (0xfcUL)                  /*!< PORT4 IOCR8: PC8 (Bitfield-Mask: 0x3f)                      */
#define PORT4_IOCR8_PC9_Pos                   (10UL)                    /*!< PORT4 IOCR8: PC9 (Bit 10)                                   */
#define PORT4_IOCR8_PC9_Msk                   (0xfc00UL)                /*!< PORT4 IOCR8: PC9 (Bitfield-Mask: 0x3f)                      */
#define PORT4_IOCR8_PC10_Pos                  (18UL)                    /*!< PORT4 IOCR8: PC10 (Bit 18)                                  */
#define PORT4_IOCR8_PC10_Msk                  (0xfc0000UL)              /*!< PORT4 IOCR8: PC10 (Bitfield-Mask: 0x3f)                     */
#define PORT4_IOCR8_PC11_Pos                  (26UL)                    /*!< PORT4 IOCR8: PC11 (Bit 26)                                  */
#define PORT4_IOCR8_PC11_Msk                  (0xfc000000UL)            /*!< PORT4 IOCR8: PC11 (Bitfield-Mask: 0x3f)                     */

/* ----------------------------------  PORT4_IN  ---------------------------------- */
#define PORT4_IN_P0_Pos                       (0UL)                     /*!< PORT4 IN: P0 (Bit 0)                                        */
#define PORT4_IN_P0_Msk                       (0x1UL)                   /*!< PORT4 IN: P0 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P1_Pos                       (1UL)                     /*!< PORT4 IN: P1 (Bit 1)                                        */
#define PORT4_IN_P1_Msk                       (0x2UL)                   /*!< PORT4 IN: P1 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P2_Pos                       (2UL)                     /*!< PORT4 IN: P2 (Bit 2)                                        */
#define PORT4_IN_P2_Msk                       (0x4UL)                   /*!< PORT4 IN: P2 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P3_Pos                       (3UL)                     /*!< PORT4 IN: P3 (Bit 3)                                        */
#define PORT4_IN_P3_Msk                       (0x8UL)                   /*!< PORT4 IN: P3 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P4_Pos                       (4UL)                     /*!< PORT4 IN: P4 (Bit 4)                                        */
#define PORT4_IN_P4_Msk                       (0x10UL)                  /*!< PORT4 IN: P4 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P5_Pos                       (5UL)                     /*!< PORT4 IN: P5 (Bit 5)                                        */
#define PORT4_IN_P5_Msk                       (0x20UL)                  /*!< PORT4 IN: P5 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P6_Pos                       (6UL)                     /*!< PORT4 IN: P6 (Bit 6)                                        */
#define PORT4_IN_P6_Msk                       (0x40UL)                  /*!< PORT4 IN: P6 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P7_Pos                       (7UL)                     /*!< PORT4 IN: P7 (Bit 7)                                        */
#define PORT4_IN_P7_Msk                       (0x80UL)                  /*!< PORT4 IN: P7 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P8_Pos                       (8UL)                     /*!< PORT4 IN: P8 (Bit 8)                                        */
#define PORT4_IN_P8_Msk                       (0x100UL)                 /*!< PORT4 IN: P8 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P9_Pos                       (9UL)                     /*!< PORT4 IN: P9 (Bit 9)                                        */
#define PORT4_IN_P9_Msk                       (0x200UL)                 /*!< PORT4 IN: P9 (Bitfield-Mask: 0x01)                          */
#define PORT4_IN_P10_Pos                      (10UL)                    /*!< PORT4 IN: P10 (Bit 10)                                      */
#define PORT4_IN_P10_Msk                      (0x400UL)                 /*!< PORT4 IN: P10 (Bitfield-Mask: 0x01)                         */
#define PORT4_IN_P11_Pos                      (11UL)                    /*!< PORT4 IN: P11 (Bit 11)                                      */
#define PORT4_IN_P11_Msk                      (0x800UL)                 /*!< PORT4 IN: P11 (Bitfield-Mask: 0x01)                         */

/* ---------------------------------  PORT4_PHCR0  -------------------------------- */
#define PORT4_PHCR0_PH0_Pos                   (2UL)                     /*!< PORT4 PHCR0: PH0 (Bit 2)                                    */
#define PORT4_PHCR0_PH0_Msk                   (0x4UL)                   /*!< PORT4 PHCR0: PH0 (Bitfield-Mask: 0x01)                      */
#define PORT4_PHCR0_PH1_Pos                   (6UL)                     /*!< PORT4 PHCR0: PH1 (Bit 6)                                    */
#define PORT4_PHCR0_PH1_Msk                   (0x40UL)                  /*!< PORT4 PHCR0: PH1 (Bitfield-Mask: 0x01)                      */
#define PORT4_PHCR0_PH2_Pos                   (10UL)                    /*!< PORT4 PHCR0: PH2 (Bit 10)                                   */
#define PORT4_PHCR0_PH2_Msk                   (0x400UL)                 /*!< PORT4 PHCR0: PH2 (Bitfield-Mask: 0x01)                      */
#define PORT4_PHCR0_PH3_Pos                   (14UL)                    /*!< PORT4 PHCR0: PH3 (Bit 14)                                   */
#define PORT4_PHCR0_PH3_Msk                   (0x4000UL)                /*!< PORT4 PHCR0: PH3 (Bitfield-Mask: 0x01)                      */
#define PORT4_PHCR0_PH4_Pos                   (18UL)                    /*!< PORT4 PHCR0: PH4 (Bit 18)                                   */
#define PORT4_PHCR0_PH4_Msk                   (0x40000UL)               /*!< PORT4 PHCR0: PH4 (Bitfield-Mask: 0x01)                      */
#define PORT4_PHCR0_PH5_Pos                   (22UL)                    /*!< PORT4 PHCR0: PH5 (Bit 22)                                   */
#define PORT4_PHCR0_PH5_Msk                   (0x400000UL)              /*!< PORT4 PHCR0: PH5 (Bitfield-Mask: 0x01)                      */
#define PORT4_PHCR0_PH6_Pos                   (26UL)                    /*!< PORT4 PHCR0: PH6 (Bit 26)                                   */
#define PORT4_PHCR0_PH6_Msk                   (0x4000000UL)             /*!< PORT4 PHCR0: PH6 (Bitfield-Mask: 0x01)                      */
#define PORT4_PHCR0_PH7_Pos                   (30UL)                    /*!< PORT4 PHCR0: PH7 (Bit 30)                                   */
#define PORT4_PHCR0_PH7_Msk                   (0x40000000UL)            /*!< PORT4 PHCR0: PH7 (Bitfield-Mask: 0x01)                      */

/* ---------------------------------  PORT4_PHCR1  -------------------------------- */
#define PORT4_PHCR1_PH8_Pos                   (2UL)                     /*!< PORT4 PHCR1: PH8 (Bit 2)                                    */
#define PORT4_PHCR1_PH8_Msk                   (0x4UL)                   /*!< PORT4 PHCR1: PH8 (Bitfield-Mask: 0x01)                      */
#define PORT4_PHCR1_PH9_Pos                   (6UL)                     /*!< PORT4 PHCR1: PH9 (Bit 6)                                    */
#define PORT4_PHCR1_PH9_Msk                   (0x40UL)                  /*!< PORT4 PHCR1: PH9 (Bitfield-Mask: 0x01)                      */
#define PORT4_PHCR1_PH10_Pos                  (10UL)                    /*!< PORT4 PHCR1: PH10 (Bit 10)                                  */
#define PORT4_PHCR1_PH10_Msk                  (0x400UL)                 /*!< PORT4 PHCR1: PH10 (Bitfield-Mask: 0x01)                     */
#define PORT4_PHCR1_PH11_Pos                  (14UL)                    /*!< PORT4 PHCR1: PH11 (Bit 14)                                  */
#define PORT4_PHCR1_PH11_Msk                  (0x4000UL)                /*!< PORT4 PHCR1: PH11 (Bitfield-Mask: 0x01)                     */

/* ---------------------------------  PORT4_PDISC  -------------------------------- */
#define PORT4_PDISC_PDIS0_Pos                 (0UL)                     /*!< PORT4 PDISC: PDIS0 (Bit 0)                                  */
#define PORT4_PDISC_PDIS0_Msk                 (0x1UL)                   /*!< PORT4 PDISC: PDIS0 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS1_Pos                 (1UL)                     /*!< PORT4 PDISC: PDIS1 (Bit 1)                                  */
#define PORT4_PDISC_PDIS1_Msk                 (0x2UL)                   /*!< PORT4 PDISC: PDIS1 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS2_Pos                 (2UL)                     /*!< PORT4 PDISC: PDIS2 (Bit 2)                                  */
#define PORT4_PDISC_PDIS2_Msk                 (0x4UL)                   /*!< PORT4 PDISC: PDIS2 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS3_Pos                 (3UL)                     /*!< PORT4 PDISC: PDIS3 (Bit 3)                                  */
#define PORT4_PDISC_PDIS3_Msk                 (0x8UL)                   /*!< PORT4 PDISC: PDIS3 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS4_Pos                 (4UL)                     /*!< PORT4 PDISC: PDIS4 (Bit 4)                                  */
#define PORT4_PDISC_PDIS4_Msk                 (0x10UL)                  /*!< PORT4 PDISC: PDIS4 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS5_Pos                 (5UL)                     /*!< PORT4 PDISC: PDIS5 (Bit 5)                                  */
#define PORT4_PDISC_PDIS5_Msk                 (0x20UL)                  /*!< PORT4 PDISC: PDIS5 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS6_Pos                 (6UL)                     /*!< PORT4 PDISC: PDIS6 (Bit 6)                                  */
#define PORT4_PDISC_PDIS6_Msk                 (0x40UL)                  /*!< PORT4 PDISC: PDIS6 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS7_Pos                 (7UL)                     /*!< PORT4 PDISC: PDIS7 (Bit 7)                                  */
#define PORT4_PDISC_PDIS7_Msk                 (0x80UL)                  /*!< PORT4 PDISC: PDIS7 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS8_Pos                 (8UL)                     /*!< PORT4 PDISC: PDIS8 (Bit 8)                                  */
#define PORT4_PDISC_PDIS8_Msk                 (0x100UL)                 /*!< PORT4 PDISC: PDIS8 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS9_Pos                 (9UL)                     /*!< PORT4 PDISC: PDIS9 (Bit 9)                                  */
#define PORT4_PDISC_PDIS9_Msk                 (0x200UL)                 /*!< PORT4 PDISC: PDIS9 (Bitfield-Mask: 0x01)                    */
#define PORT4_PDISC_PDIS10_Pos                (10UL)                    /*!< PORT4 PDISC: PDIS10 (Bit 10)                                */
#define PORT4_PDISC_PDIS10_Msk                (0x400UL)                 /*!< PORT4 PDISC: PDIS10 (Bitfield-Mask: 0x01)                   */
#define PORT4_PDISC_PDIS11_Pos                (11UL)                    /*!< PORT4 PDISC: PDIS11 (Bit 11)                                */
#define PORT4_PDISC_PDIS11_Msk                (0x800UL)                 /*!< PORT4 PDISC: PDIS11 (Bitfield-Mask: 0x01)                   */

